import { component$ } from '@builder.io/qwik'

export default component$(() => {
    return (
        <div>
            <h1>プライバシーポリシー</h1>
            <p>最終更新日: 2024年8月14日</p>

            <h2>1. 個人情報の取り扱いについて</h2>
            <p>
                GRILLWARE,
                Inc.（以下、「当社」といいます）は、お客様の個人情報の保護を最優先に考えております。当社は、お客様の個人情報を適切に取り扱い、その保護に努めます。
            </p>

            <h2>2. 収集する情報</h2>
            <p>
                当社は、ウェブサイトの利用登録時やサービスに関連する活動を行う際、またはお客様が当社に連絡する際に、お客様が自発的に提供する個人情報を収集します。これには、名前、メールアドレス、電話番号、その他の連絡先情報が含まれます。
            </p>

            <h2>3. 個人情報の利用目的</h2>
            <p>
                当社は、お客様から提供された個人情報を以下の目的で利用します。
            </p>
            <ul>
                <li>当社のサービス提供および維持のため</li>
                <li>お客様からのお問い合わせに対応するため</li>
                <li>サービスの改善および新しいサービスの開発のため</li>
                <li>法的義務の履行のため</li>
            </ul>

            <h2>4. 個人情報の第三者提供</h2>
            <p>
                当社は、以下の場合を除き、お客様の個人情報を第三者に提供することはありません。
            </p>
            <ul>
                <li>お客様の同意がある場合</li>
                <li>法令に基づく場合</li>
                <li>
                    人命、身体、財産の保護のために必要であり、お客様の同意を得ることが困難である場合
                </li>
                <li>
                    公衆衛生の向上や児童の健全な育成推進のために特に必要であり、お客様の同意を得ることが困難である場合
                </li>
            </ul>

            <h2>5. お客様の権利</h2>
            <p>お客様は、ご自身の個人情報に関して以下の権利を有しています。</p>
            <ul>
                <li>個人情報の開示、訂正、削除を要求する権利</li>
                <li>個人情報の利用停止を要求する権利</li>
                <li>データポータビリティの権利</li>
            </ul>

            <h2>6. お問い合わせ</h2>
            <p>
                本ポリシーに関するご質問やご意見がございましたら、以下の連絡先までお問い合わせください。
            </p>
            <address>tokunaga@grill-ware.com</address>
        </div>
    )
})
